{ headshot = Some "https://avatars.githubusercontent.com/u/17092044?v=4"
, jobHistory =
  [ { company =
      { defunct = False
      , location =
        { city = "San Diego"
        , country = "USA"
        , remote = True
        , stateOrProvince = "CA"
        }
      , name = "Virgo Surgical Video Solutions"
      , url = Some "https://virgosvs.com"
      }
    , contract = False
    , daysBetween = None Natural
    , daysWorked = None Natural
    , endDate = Some "2024-01"
    , hideFromResume = False
    , highlights =
      [ "Fully automated the CI/CD pipeline for all 15 service repositories and our Terraform infrastructure, reducing deployment time and minimizing production deployment risks."
      , "Built bespoke certificate management service to create a secured, centralized authority for inter-service and field device certificate management; reducing cost, configuration and deployment complexity. (Python, Golang)"
      , "Updated service code to implement zero-trust security best practices, strengthening authentication and access control, which reduced security vulnerabilities and enhanced compliance readiness. (Python, Golang)"
      , "Deployed production services across multiple global regions, reducing latency and improving application availability for international users while also ensuring compliance with country-specific data residency and regulatory requirements."
      , "Automated certificate rotation and introduced ephemeral certificates, strengthening security and reducing manual intervention, lowering the risk of expired or compromised credentials."
      , "Leveraged Nix to standardize developer environments, cutting onboarding time allowing new engineers to contribute faster and reducing setup inconsistencies."
      ]
    , leaveReason = Some "Company Closure"
    , locations =
      [ { city = "San Diego"
        , country = "USA"
        , remote = True
        , stateOrProvince = "CA"
        }
      ]
    , startDate = "2024-01"
    , summary = ""
    , title = "Senior DevOps Engineer"
    }
  , { company =
      { defunct = False
      , location =
        { city = "San Francisco"
        , country = "USA"
        , remote = True
        , stateOrProvince = "CA"
        }
      , name = "Gremlin"
      , url = Some "https://gremlin.com"
      }
    , contract = False
    , daysBetween = None Natural
    , daysWorked = None Natural
    , endDate = Some "2023-01"
    , hideFromResume = False
    , highlights =
      [ "Designed and implemented cgroup v2 support for Gremlin machine agents improving resource isolation and ensuring compatibility with modern Linux distributions. (Rust)"
      , "Redesigned a high-throughput and spikey DynamoDB table, reducing write costs by 30-45 percent for some customers, improving performance and lowering operational expenses."
      , "Separated staging and production environments into isolated AWS accounts with no downtime, aligning with AWS Well-Architected best practices and enhancing security."
      , "Migrated CloudFormation stacks into Terraform without redeploying resources, simplifying infrastructure as code and improving maintainability."
      ]
    , leaveReason = Some "Mass Layoffs"
    , locations =
      [ { city = "San Francisco"
        , country = "USA"
        , remote = True
        , stateOrProvince = "CA"
        }
      ]
    , startDate = "2021-03"
    , summary = ""
    , title = "Senior Platform & Backend Engineer"
    }
  , { company =
      { defunct = True
      , location =
        { city = "San Antonio"
        , country = "USA"
        , remote = True
        , stateOrProvince = "TX"
        }
      , name = "Onica, a Rackspace company"
      , url = Some "https://www.rackspace.com"
      }
    , contract = False
    , daysBetween = None Natural
    , daysWorked = None Natural
    , endDate = Some "2021-03"
    , hideFromResume = False
    , highlights = [] : List Text
    , leaveReason = Some "Misalignment"
    , locations =
      [ { city = "San Antonio"
        , country = "USA"
        , remote = True
        , stateOrProvince = "TX"
        }
      ]
    , startDate = "2020-06"
    , summary =
        "At Onica, I developed custom Python plugins to streamline Istio service mesh deployment, simplifying service integration and reducing manual effort. I designed and tested CloudFormation templates using Troposphere, ensuring scalable and consistent infrastructure provisioning. Additionally, I contributed to the Troposphere OSS project, improving automation reliability, and containerized development environments with Docker to enhance reproducibility and accelerate developer onboarding."
    , title = "Senior Cloud Engineer"
    }
  , { company =
      { defunct = True
      , location =
        { city = "Los Angeles"
        , country = "USA"
        , remote = True
        , stateOrProvince = "CA"
        }
      , name = "Rival labs, inc."
      , url = None Text
      }
    , contract = False
    , daysBetween = None Natural
    , daysWorked = None Natural
    , endDate = Some "2020-06"
    , hideFromResume = False
    , highlights = [] : List Text
    , leaveReason = Some "Company Closure"
    , locations =
      [ { city = "Los Angeles"
        , country = "USA"
        , remote = True
        , stateOrProvince = "CA"
        }
      ]
    , startDate = "2019-09"
    , summary =
        "At Rival Labs, I collaborated with application owners to define Service Level Objectives (SLOs) and Service Level Indicators (SLIs), improving visibility into service reliability. I developed SLO dashboards to track uptime and performance, integrated Datadog event logging, and implemented proactive monitoring and alerting to enhance system observability. I also advocated for continuous delivery and feature flag adoption, enabling safer and faster deployments. Additionally, I contributed to Terraform infrastructure, patching upstream provider bugs, improving internal modules, and automating cloud deployments."
    , title = "Software Engineer"
    }
  , { company =
      { defunct = False
      , location =
        { city = "Dallas"
        , country = "USA"
        , remote = False
        , stateOrProvince = "TX"
        }
      , name = "Southwest Airlines"
      , url = Some "https://www.southwest.com"
      }
    , contract = False
    , daysBetween = None Natural
    , daysWorked = None Natural
    , endDate = Some "2019-09"
    , hideFromResume = False
    , highlights = [] : List Text
    , leaveReason = Some "New opportunity"
    , locations =
      [ { city = "Dallas"
        , country = "USA"
        , remote = False
        , stateOrProvince = "TX"
        }
      ]
    , startDate = "2018-10"
    , summary =
        "At Southwest Airlines, I managed and deployed EKS clusters across nine environments, serving as the Kubernetes subject matter expert and educating teams on best practices. I redesigned the logging architecture to dynamically scale with demand, handling peak bursts of 13GB/s of logs. I implemented Prometheus monitoring and alerting, enabling teams to self-service observability, and exposed custom Prometheus metrics to Kubernetes for HPA-based autoscaling. Additionally, I developed an automated recovery pipeline using AWS Lambda, reducing downtime by triggering corrective actions before escalation. To enhance reliability, I introduced post-mortems and SLO-based monitoring, fostering a proactive approach to incident management and service quality."
    , title = "Software Engineer"
    }
  , { company =
      { defunct = True
      , location =
        { city = "Kansas City"
        , country = "USA"
        , remote = False
        , stateOrProvince = "MO"
        }
      , name = "Cerner Corporation"
      , url = Some "https://www.oracle.com/health/"
      }
    , contract = False
    , daysBetween = None Natural
    , daysWorked = None Natural
    , endDate = Some "2018-10"
    , hideFromResume = False
    , highlights = [] : List Text
    , leaveReason = Some "New Opportunity"
    , locations =
      [ { city = "Kansas City"
        , country = "USA"
        , remote = False
        , stateOrProvince = "MO"
        }
      ]
    , startDate = "2016-02"
    , summary =
        "At Cerner, I designed and deployed a globally available Artifactory repository across hybrid AWS and on-prem environments, leveraging Ansible automation for consistent builds and deployments. I implemented auto-scaling groups in AWS, integrating with CloudWatch monitoring to dynamically scale EC2 instances based on demand. To enhance security and reliability, I deployed high-availability HashiCorp Vault instances with a Consul backend on Kubernetes and automated etcd backups to S3. Additionally, I introduced CI/CD best practices, authored Kubernetes and containerization documentation, and conducted training sessions on Ansible automation and Git flow. I also streamlined bare metal server provisioning, reducing deployment time from three weeks to just 30 minutes through automation."
    , title = "Site Reliability Engineer"
    }
  ]
, name = "Cory Twitty"
, summary =
    "I am an experienced Cloud Engineer, Architect, and Systems Engineer with a pragmatic, problem-solving mindset and a strong belief in using the right tool for the job—whether in software, infrastructure, or process design. I have strong opinions but hold them weakly, always open to new ideas and better ways of doing things. I believe that most problems stem from miscommunication rather than pure engineering challenges, and I prioritize clarity and collaboration to prevent that. My experience spans cloud architecture, infrastructure automation, and low-level systems engineering. I enjoy building reliable, scalable systems and refining workflows to enhance efficiency. Learning is a lifelong pursuit of mine—I thrive on exploring new technologies, understanding how things work under the hood, and continuously improving both my craft and the environments I work in."
, title = Some "Senior SRE"
}
